<?php
// Налаштування для підключення до бази даних
$host = 'localhost';       // Хост (localhost якщо база на тому ж сервері)
$dbname = '0000'; // Назва вашої бази даних
$username = '0000'; // Ваше ім'я користувача для БД
$password = '0000'; // Ваш пароль для БД


// Перевірка підключення до БД
try {
    // Створюємо екземпляр PDO для підключення
    $pdo = new PDO("mysql:host=$host;dbname=$dbname", $username, $password);

    // Встановлюємо режим обробки помилок
    $pdo->setAttribute(PDO::ATTR_ERRMODE, PDO::ERRMODE_EXCEPTION);

    // Повідомлення про успішне підключення
    // echo "З'єднання з базою даних успішне!";
} catch (PDOException $e) {
    // Якщо сталася помилка підключення, виводимо її
    echo "Помилка з'єднання: " . $e->getMessage();
    exit(); // Перериваємо виконання коду
}
?>